MikroElektronika/core_packages/PIC/XC8/def/PIC16LF18855/mcu.h
// Register: CCP4CAP
#define CCP4CAP CCP4CAP
extern volatile unsigned char           CCP4CAP             __at(0x31B);
#ifndef _LIB_BUILD
asm("CCP4CAP equ 031Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CTS                    :8;
    };
    struct {
        unsigned CTS0                   :1;
        unsigned CTS1                   :1;
        unsigned CTS2                   :1;
    };
    struct {
        unsigned CCP4CTS                :8;
    };
    struct {
        unsigned CCP4CTS0               :1;
        unsigned CCP4CTS1               :1;
        unsigned CCP4CTS2               :1;
    };
} CCP4CAPbits_t;
extern volatile CCP4CAPbits_t CCP4CAPbits __at(0x31B);
// bitfield macros
#define _CCP4CAP_CTS_POSN                                   0x0
#define _CCP4CAP_CTS_POSITION                               0x0
#define _CCP4CAP_CTS_SIZE                                   0x8
#define _CCP4CAP_CTS_LENGTH                                 0x8
#define _CCP4CAP_CTS_MASK                                   0xFF
#define _CCP4CAP_CTS0_POSN                                  0x0
#define _CCP4CAP_CTS0_POSITION                              0x0
#define _CCP4CAP_CTS0_SIZE                                  0x1
#define _CCP4CAP_CTS0_LENGTH                                0x1
#define _CCP4CAP_CTS0_MASK                                  0x1
#define _CCP4CAP_CTS1_POSN                                  0x1
#define _CCP4CAP_CTS1_POSITION                              0x1
#define _CCP4CAP_CTS1_SIZE                                  0x1
#define _CCP4CAP_CTS1_LENGTH                                0x1
#define _CCP4CAP_CTS1_MASK                                  0x2
#define _CCP4CAP_CTS2_POSN                                  0x2
#define _CCP4CAP_CTS2_POSITION                              0x2
#define _CCP4CAP_CTS2_SIZE                                  0x1
#define _CCP4CAP_CTS2_LENGTH                                0x1
#define _CCP4CAP_CTS2_MASK                                  0x4
#define _CCP4CAP_CCP4CTS_POSN                               0x0
#define _CCP4CAP_CCP4CTS_POSITION                           0x0
#define _CCP4CAP_CCP4CTS_SIZE                               0x8
#define _CCP4CAP_CCP4CTS_LENGTH                             0x8
#define _CCP4CAP_CCP4CTS_MASK                               0xFF
#define _CCP4CAP_CCP4CTS0_POSN                              0x0
#define _CCP4CAP_CCP4CTS0_POSITION                          0x0
#define _CCP4CAP_CCP4CTS0_SIZE                              0x1
#define _CCP4CAP_CCP4CTS0_LENGTH                            0x1
#define _CCP4CAP_CCP4CTS0_MASK                              0x1
#define _CCP4CAP_CCP4CTS1_POSN                              0x1
#define _CCP4CAP_CCP4CTS1_POSITION                          0x1
#define _CCP4CAP_CCP4CTS1_SIZE                              0x1
#define _CCP4CAP_CCP4CTS1_LENGTH                            0x1
#define _CCP4CAP_CCP4CTS1_MASK                              0x2
#define _CCP4CAP_CCP4CTS2_POSN                              0x2
#define _CCP4CAP_CCP4CTS2_POSITION                          0x2
#define _CCP4CAP_CCP4CTS2_SIZE                              0x1
#define _CCP4CAP_CCP4CTS2_LENGTH                            0x1
#define _CCP4CAP_CCP4CTS2_MASK                              0x4

// Register: CCPR5
#define CCPR5 CCPR5
extern volatile unsigned short          CCPR5               __at(0x31C);
#ifndef _LIB_BUILD
asm("CCPR5 equ 031Ch");
#endif

// Register: CCPR5L
#define CCPR5L CCPR5L
extern volatile unsigned char           CCPR5L              __at(0x31C);
#ifndef _LIB_BUILD
asm("CCPR5L equ 031Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RL                     :8;
    };
} CCPR5Lbits_t;
extern volatile CCPR5Lbits_t CCPR5Lbits __at(0x31C);
// bitfield macros
#define _CCPR5L_RL_POSN                                     0x0
#define _CCPR5L_RL_POSITION                                 0x0
#define _CCPR5L_RL_SIZE                                     0x8
#define _CCPR5L_RL_LENGTH                                   0x8
#define _CCPR5L_RL_MASK                                     0xFF

// Register: CCPR5H
#define CCPR5H CCPR5H
extern volatile unsigned char           CCPR5H              __at(0x31D);
#ifndef _LIB_BUILD
asm("CCPR5H equ 031Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RH                     :8;
    };
} CCPR5Hbits_t;
extern volatile CCPR5Hbits_t CCPR5Hbits __at(0x31D);
// bitfield macros
#define _CCPR5H_RH_POSN                                     0x0
#define _CCPR5H_RH_POSITION                                 0x0
#define _CCPR5H_RH_SIZE                                     0x8
#define _CCPR5H_RH_LENGTH                                   0x8
#define _CCPR5H_RH_MASK                                     0xFF

// Register: CCP5CON
#define CCP5CON CCP5CON
extern volatile unsigned char           CCP5CON             __at(0x31E);
#ifndef _LIB_BUILD
asm("CCP5CON equ 031Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MODE                   :4;
        unsigned FMT                    :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
        unsigned MODE2                  :1;
        unsigned MODE3                  :1;
    };
    struct {
        unsigned CCP5MODE               :4;
        unsigned CCP5FMT                :1;
        unsigned CCP5OUT                :1;
        unsigned                        :1;
        unsigned CCP5EN                 :1;
    };
    struct {
        unsigned CCP5MODE0              :1;
        unsigned CCP5MODE1              :1;
        unsigned CCP5MODE2              :1;
        unsigned CCP5MODE3              :1;
    };
} CCP5CONbits_t;
extern volatile CCP5CONbits_t CCP5CONbits __at(0x31E);
// bitfield macros
#define _CCP5CON_MODE_POSN                                  0x0
#define _CCP5CON_MODE_POSITION                              0x0
#define _CCP5CON_MODE_SIZE                                  0x4
#define _CCP5CON_MODE_LENGTH                                0x4
#define _CCP5CON_MODE_MASK                                  0xF
#define _CCP5CON_FMT_POSN                                   0x4
#define _CCP5CON_FMT_POSITION                               0x4
#define _CCP5CON_FMT_SIZE                                   0x1
#define _CCP5CON_FMT_LENGTH                                 0x1
#define _CCP5CON_FMT_MASK                                   0x10
#define _CCP5CON_OUT_POSN                                   0x5
#define _CCP5CON_OUT_POSITION                               0x5
#define _CCP5CON_OUT_SIZE                                   0x1
#define _CCP5CON_OUT_LENGTH                                 0x1
#define _CCP5CON_OUT_MASK                                   0x20
#define _CCP5CON_EN_POSN                                    0x7
#define _CCP5CON_EN_POSITION                                0x7
#define _CCP5CON_EN_SIZE                                    0x1
#define _CCP5CON_EN_LENGTH                                  0x1
#define _CCP5CON_EN_MASK                                    0x80
#define _CCP5CON_MODE0_POSN                                 0x0
#define _CCP5CON_MODE0_POSITION                             0x0
#define _CCP5CON_MODE0_SIZE                                 0x1
#define _CCP5CON_MODE0_LENGTH                               0x1
#define _CCP5CON_MODE0_MASK                                 0x1
#define _CCP5CON_MODE1_POSN                                 0x1
#define _CCP5CON_MODE1_POSITION                             0x1
#define _CCP5CON_MODE1_SIZE                                 0x1
#define _CCP5CON_MODE1_LENGTH                               0x1
#define _CCP5CON_MODE1_MASK                                 0x2
#define _CCP5CON_MODE2_POSN                                 0x2
#define _CCP5CON_MODE2_POSITION                             0x2
#define _CCP5CON_MODE2_SIZE                                 0x1
#define _CCP5CON_MODE2_LENGTH                               0x1
#define _CCP5CON_MODE2_MASK                                 0x4
#define _CCP5CON_MODE3_POSN                                 0x3
#define _CCP5CON_MODE3_POSITION                             0x3
#define _CCP5CON_MODE3_SIZE                                 0x1
#define _CCP5CON_MODE3_LENGTH                               0x1
#define _CCP5CON_MODE3_MASK                                 0x8
#define _CCP5CON_CCP5MODE_POSN                              0x0
#define _CCP5CON_CCP5MODE_POSITION                          0x0
#define _CCP5CON_CCP5MODE_SIZE                              0x4
#define _CCP5CON_CCP5MODE_LENGTH                            0x4
#define _CCP5CON_CCP5MODE_MASK                              0xF
#define _CCP5CON_CCP5FMT_POSN                               0x4
#define _CCP5CON_CCP5FMT_POSITION                           0x4
#define _CCP5CON_CCP5FMT_SIZE                               0x1
#define _CCP5CON_CCP5FMT_LENGTH                             0x1
#define _CCP5CON_CCP5FMT_MASK                               0x10
#define _CCP5CON_CCP5OUT_POSN                               0x5
#define _CCP5CON_CCP5OUT_POSITION                           0x5
#define _CCP5CON_CCP5OUT_SIZE                               0x1
#define _CCP5CON_CCP5OUT_LENGTH                             0x1
#define _CCP5CON_CCP5OUT_MASK                               0x20
#define _CCP5CON_CCP5EN_POSN                                0x7
#define _CCP5CON_CCP5EN_POSITION                            0x7
#define _CCP5CON_CCP5EN_SIZE                                0x1
#define _CCP5CON_CCP5EN_LENGTH                              0x1
#define _CCP5CON_CCP5EN_MASK                                0x80
#define _CCP5CON_CCP5MODE0_POSN                             0x0
#define _CCP5CON_CCP5MODE0_POSITION                         0x0
#define _CCP5CON_CCP5MODE0_SIZE                             0x1
#define _CCP5CON_CCP5MODE0_LENGTH                           0x1
#define _CCP5CON_CCP5MODE0_MASK                             0x1
#define _CCP5CON_CCP5MODE1_POSN                             0x1
#define _CCP5CON_CCP5MODE1_POSITION                         0x1
#define _CCP5CON_CCP5MODE1_SIZE                             0x1
#define _CCP5CON_CCP5MODE1_LENGTH                           0x1
#define _CCP5CON_CCP5MODE1_MASK                             0x2
#define _CCP5CON_CCP5MODE2_POSN                             0x2
#define _CCP5CON_CCP5MODE2_POSITION                         0x2
#define _CCP5CON_CCP5MODE2_SIZE                             0x1
#define _CCP5CON_CCP5MODE2_LENGTH                           0x1
#define _CCP5CON_CCP5MODE2_MASK                             0x4
#define _CCP5CON_CCP5MODE3_POSN                             0x3
#define _CCP5CON_CCP5MODE3_POSITION                         0x3
#define _CCP5CON_CCP5MODE3_SIZE                             0x1
#define _CCP5CON_CCP5MODE3_LENGTH                           0x1
#define _CCP5CON_CCP5MODE3_MASK                             0x8

// Register: CCP5CAP
#define CCP5CAP CCP5CAP
extern volatile unsigned char           CCP5CAP             __at(0x31F);
#ifndef _LIB_BUILD
asm("CCP5CAP equ 031Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CTS                    :8;
    };
    struct {
        unsigned CTS0                   :1;
        unsigned CTS1                   :1;
        unsigned CTS2                   :1;
    };
    struct {
        unsigned CCP5CTS                :8;
    };
    struct {
        unsigned CCP5CTS0               :1;
        unsigned CCP5CTS1               :1;
        unsigned CCP5CTS2               :1;
    };
} CCP5CAPbits_t;
extern volatile CCP5CAPbits_t CCP5CAPbits __at(0x31F);
// bitfield macros
#define _CCP5CAP_CTS_POSN                                   0x0
#define _CCP5CAP_CTS_POSITION                               0x0
#define _CCP5CAP_CTS_SIZE                                   0x8
#define _CCP5CAP_CTS_LENGTH                                 0x8
#define _CCP5CAP_CTS_MASK                                   0xFF
#define _CCP5CAP_CTS0_POSN                                  0x0
#define _CCP5CAP_CTS0_POSITION                              0x0
#define _CCP5CAP_CTS0_SIZE                                  0x1
#define _CCP5CAP_CTS0_LENGTH                                0x1
#define _CCP5CAP_CTS0_MASK                                  0x1
#define _CCP5CAP_CTS1_POSN                                  0x1
#define _CCP5CAP_CTS1_POSITION                              0x1
#define _CCP5CAP_CTS1_SIZE                                  0x1
#define _CCP5CAP_CTS1_LENGTH                                0x1
#define _CCP5CAP_CTS1_MASK                                  0x2
#define _CCP5CAP_CTS2_POSN                                  0x2
#define _CCP5CAP_CTS2_POSITION                              0x2
#define _CCP5CAP_CTS2_SIZE                                  0x1
#define _CCP5CAP_CTS2_LENGTH                                0x1
#define _CCP5CAP_CTS2_MASK                                  0x4
#define _CCP5CAP_CCP5CTS_POSN                               0x0
#define _CCP5CAP_CCP5CTS_POSITION                           0x0
#define _CCP5CAP_CCP5CTS_SIZE                               0x8
#define _CCP5CAP_CCP5CTS_LENGTH                             0x8
#define _CCP5CAP_CCP5CTS_MASK                               0xFF
#define _CCP5CAP_CCP5CTS0_POSN                              0x0
#define _CCP5CAP_CCP5CTS0_POSITION                          0x0
#define _CCP5CAP_CCP5CTS0_SIZE                              0x1
#define _CCP5CAP_CCP5CTS0_LENGTH                            0x1
#define _CCP5CAP_CCP5CTS0_MASK                              0x1
#define _CCP5CAP_CCP5CTS1_POSN                              0x1
#define _CCP5CAP_CCP5CTS1_POSITION                          0x1
#define _CCP5CAP_CCP5CTS1_SIZE                              0x1
#define _CCP5CAP_CCP5CTS1_LENGTH                            0x1
#define _CCP5CAP_CCP5CTS1_MASK                              0x2
#define _CCP5CAP_CCP5CTS2_POSN                              0x2
#define _CCP5CAP_CCP5CTS2_POSITION                          0x2
#define _CCP5CAP_CCP5CTS2_SIZE                              0x1
#define _CCP5CAP_CCP5CTS2_LENGTH                            0x1
#define _CCP5CAP_CCP5CTS2_MASK                              0x4

// Register: PWM6DC
#define PWM6DC PWM6DC
extern volatile unsigned short          PWM6DC              __at(0x38C);
#ifndef _LIB_BUILD
asm("PWM6DC equ 038Ch");
#endif

// Register: PWM6DCL
#define PWM6DCL PWM6DCL
extern volatile unsigned char           PWM6DCL             __at(0x38C);
#ifndef _LIB_BUILD
asm("PWM6DCL equ 038Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :6;
        unsigned DC                     :2;
    };
    struct {
        unsigned                        :6;
        unsigned DC0                    :1;
        unsigned DC1                    :1;
    };
    struct {
        unsigned                        :6;
        unsigned PWM6DC0                :1;
        unsigned PWM6DC1                :1;
    };
    struct {
        unsigned                        :6;
        unsigned PWMPW0                 :1;
        unsigned PWMPW1                 :1;
    };
} PWM6DCLbits_t;
extern volatile PWM6DCLbits_t PWM6DCLbits __at(0x38C);
// bitfield macros
#define _PWM6DCL_DC_POSN                                    0x6
#define _PWM6DCL_DC_POSITION                                0x6
#define _PWM6DCL_DC_SIZE                                    0x2
#define _PWM6DCL_DC_LENGTH                                  0x2
#define _PWM6DCL_DC_MASK                                    0xC0
#define _PWM6DCL_DC0_POSN                                   0x6
#define _PWM6DCL_DC0_POSITION                               0x6
#define _PWM6DCL_DC0_SIZE                                   0x1
#define _PWM6DCL_DC0_LENGTH                                 0x1
#define _PWM6DCL_DC0_MASK                                   0x40
#define _PWM6DCL_DC1_POSN                                   0x7
#define _PWM6DCL_DC1_POSITION                               0x7
#define _PWM6DCL_DC1_SIZE                                   0x1
#define _PWM6DCL_DC1_LENGTH                                 0x1
#define _PWM6DCL_DC1_MASK                                   0x80
#define _PWM6DCL_PWM6DC0_POSN                               0x6
#define _PWM6DCL_PWM6DC0_POSITION                           0x6
#define _PWM6DCL_PWM6DC0_SIZE                               0x1
#define _PWM6DCL_PWM6DC0_LENGTH                             0x1
#define _PWM6DCL_PWM6DC0_MASK                               0x40
#define _PWM6DCL_PWM6DC1_POSN                               0x7
#define _PWM6DCL_PWM6DC1_POSITION                           0x7
#define _PWM6DCL_PWM6DC1_SIZE                               0x1
#define _PWM6DCL_PWM6DC1_LENGTH                             0x1
#define _PWM6DCL_PWM6DC1_MASK                               0x80
#define _PWM6DCL_PWMPW0_POSN                                0x6
#define _PWM6DCL_PWMPW0_POSITION                            0x6
#define _PWM6DCL_PWMPW0_SIZE                                0x1
#define _PWM6DCL_PWMPW0_LENGTH                              0x1
#define _PWM6DCL_PWMPW0_MASK                                0x40
#define _PWM6DCL_PWMPW1_POSN                                0x7
#define _PWM6DCL_PWMPW1_POSITION                            0x7
#define _PWM6DCL_PWMPW1_SIZE                                0x1
#define _PWM6DCL_PWMPW1_LENGTH                              0x1
#define _PWM6DCL_PWMPW1_MASK                                0x80

// Register: PWM6DCH
#define PWM6DCH PWM6DCH
extern volatile unsigned char           PWM6DCH             __at(0x38D);
#ifndef _LIB_BUILD
asm("PWM6DCH equ 038Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DC                     :8;
    };
    struct {
        unsigned DC2                    :1;
        unsigned DC3                    :1;
        unsigned DC4                    :1;
        unsigned DC5                    :1;
        unsigned DC6                    :1;
        unsigned DC7                    :1;
        unsigned DC8                    :1;
        unsigned DC9                    :1;
    };
    struct {
        unsigned PWM6DC2                :1;
        unsigned PWM6DC3                :1;
        unsigned PWM6DC4                :1;
        unsigned PWM6DC5                :1;
        unsigned PWM6DC6                :1;
        unsigned PWM6DC7                :1;
        unsigned PWM6DC8                :1;
        unsigned PWM6DC9                :1;
    };
    struct {
        unsigned PWMPW2                 :1;
        unsigned PWMPW3                 :1;
        unsigned PWMPW4                 :1;
        unsigned PWMPW5                 :1;
        unsigned PWMPW6                 :1;
        unsigned PWMPW7                 :1;
        unsigned PWMPW8                 :1;
        unsigned PWMPW9                 :1;
    };
} PWM6DCHbits_t;
