MikroElektronika/core_packages/PIC/XC8/def/PIC16LF18855/mcu.h
extern volatile ADCACTPPSbits_t ADCACTPPSbits __at(0xEC3);
// bitfield macros
#define _ADCACTPPS_ADCACTPPS0_POSN                          0x0
#define _ADCACTPPS_ADCACTPPS0_POSITION                      0x0
#define _ADCACTPPS_ADCACTPPS0_SIZE                          0x1
#define _ADCACTPPS_ADCACTPPS0_LENGTH                        0x1
#define _ADCACTPPS_ADCACTPPS0_MASK                          0x1
#define _ADCACTPPS_ADCACTPPS1_POSN                          0x1
#define _ADCACTPPS_ADCACTPPS1_POSITION                      0x1
#define _ADCACTPPS_ADCACTPPS1_SIZE                          0x1
#define _ADCACTPPS_ADCACTPPS1_LENGTH                        0x1
#define _ADCACTPPS_ADCACTPPS1_MASK                          0x2
#define _ADCACTPPS_ADCACTPPS2_POSN                          0x2
#define _ADCACTPPS_ADCACTPPS2_POSITION                      0x2
#define _ADCACTPPS_ADCACTPPS2_SIZE                          0x1
#define _ADCACTPPS_ADCACTPPS2_LENGTH                        0x1
#define _ADCACTPPS_ADCACTPPS2_MASK                          0x4
#define _ADCACTPPS_ADCACTPPS3_POSN                          0x3
#define _ADCACTPPS_ADCACTPPS3_POSITION                      0x3
#define _ADCACTPPS_ADCACTPPS3_SIZE                          0x1
#define _ADCACTPPS_ADCACTPPS3_LENGTH                        0x1
#define _ADCACTPPS_ADCACTPPS3_MASK                          0x8
#define _ADCACTPPS_ADCACTPPS4_POSN                          0x4
#define _ADCACTPPS_ADCACTPPS4_POSITION                      0x4
#define _ADCACTPPS_ADCACTPPS4_SIZE                          0x1
#define _ADCACTPPS_ADCACTPPS4_LENGTH                        0x1
#define _ADCACTPPS_ADCACTPPS4_MASK                          0x10
#define _ADCACTPPS_ADCACTPPS_POSN                           0x0
#define _ADCACTPPS_ADCACTPPS_POSITION                       0x0
#define _ADCACTPPS_ADCACTPPS_SIZE                           0x5
#define _ADCACTPPS_ADCACTPPS_LENGTH                         0x5
#define _ADCACTPPS_ADCACTPPS_MASK                           0x1F

// Register: SSP1CLKPPS
#define SSP1CLKPPS SSP1CLKPPS
extern volatile unsigned char           SSP1CLKPPS          __at(0xEC5);
#ifndef _LIB_BUILD
asm("SSP1CLKPPS equ 0EC5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSP1CLKPPS0            :1;
        unsigned SSP1CLKPPS1            :1;
        unsigned SSP1CLKPPS2            :1;
        unsigned SSP1CLKPPS3            :1;
        unsigned SSP1CLKPPS4            :1;
    };
    struct {
        unsigned SSP1CLKPPS             :5;
    };
} SSP1CLKPPSbits_t;
extern volatile SSP1CLKPPSbits_t SSP1CLKPPSbits __at(0xEC5);
// bitfield macros
#define _SSP1CLKPPS_SSP1CLKPPS0_POSN                        0x0
#define _SSP1CLKPPS_SSP1CLKPPS0_POSITION                    0x0
#define _SSP1CLKPPS_SSP1CLKPPS0_SIZE                        0x1
#define _SSP1CLKPPS_SSP1CLKPPS0_LENGTH                      0x1
#define _SSP1CLKPPS_SSP1CLKPPS0_MASK                        0x1
#define _SSP1CLKPPS_SSP1CLKPPS1_POSN                        0x1
#define _SSP1CLKPPS_SSP1CLKPPS1_POSITION                    0x1
#define _SSP1CLKPPS_SSP1CLKPPS1_SIZE                        0x1
#define _SSP1CLKPPS_SSP1CLKPPS1_LENGTH                      0x1
#define _SSP1CLKPPS_SSP1CLKPPS1_MASK                        0x2
#define _SSP1CLKPPS_SSP1CLKPPS2_POSN                        0x2
#define _SSP1CLKPPS_SSP1CLKPPS2_POSITION                    0x2
#define _SSP1CLKPPS_SSP1CLKPPS2_SIZE                        0x1
#define _SSP1CLKPPS_SSP1CLKPPS2_LENGTH                      0x1
#define _SSP1CLKPPS_SSP1CLKPPS2_MASK                        0x4
#define _SSP1CLKPPS_SSP1CLKPPS3_POSN                        0x3
#define _SSP1CLKPPS_SSP1CLKPPS3_POSITION                    0x3
#define _SSP1CLKPPS_SSP1CLKPPS3_SIZE                        0x1
#define _SSP1CLKPPS_SSP1CLKPPS3_LENGTH                      0x1
#define _SSP1CLKPPS_SSP1CLKPPS3_MASK                        0x8
#define _SSP1CLKPPS_SSP1CLKPPS4_POSN                        0x4
#define _SSP1CLKPPS_SSP1CLKPPS4_POSITION                    0x4
#define _SSP1CLKPPS_SSP1CLKPPS4_SIZE                        0x1
#define _SSP1CLKPPS_SSP1CLKPPS4_LENGTH                      0x1
#define _SSP1CLKPPS_SSP1CLKPPS4_MASK                        0x10
#define _SSP1CLKPPS_SSP1CLKPPS_POSN                         0x0
#define _SSP1CLKPPS_SSP1CLKPPS_POSITION                     0x0
#define _SSP1CLKPPS_SSP1CLKPPS_SIZE                         0x5
#define _SSP1CLKPPS_SSP1CLKPPS_LENGTH                       0x5
#define _SSP1CLKPPS_SSP1CLKPPS_MASK                         0x1F

// Register: SSP1DATPPS
#define SSP1DATPPS SSP1DATPPS
extern volatile unsigned char           SSP1DATPPS          __at(0xEC6);
#ifndef _LIB_BUILD
asm("SSP1DATPPS equ 0EC6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSP1DATPPS0            :1;
        unsigned SSP1DATPPS1            :1;
        unsigned SSP1DATPPS2            :1;
        unsigned SSP1DATPPS3            :1;
        unsigned SSP1DATPPS4            :1;
    };
    struct {
        unsigned SSP1DATPPS             :5;
    };
} SSP1DATPPSbits_t;
extern volatile SSP1DATPPSbits_t SSP1DATPPSbits __at(0xEC6);
// bitfield macros
#define _SSP1DATPPS_SSP1DATPPS0_POSN                        0x0
#define _SSP1DATPPS_SSP1DATPPS0_POSITION                    0x0
#define _SSP1DATPPS_SSP1DATPPS0_SIZE                        0x1
#define _SSP1DATPPS_SSP1DATPPS0_LENGTH                      0x1
#define _SSP1DATPPS_SSP1DATPPS0_MASK                        0x1
#define _SSP1DATPPS_SSP1DATPPS1_POSN                        0x1
#define _SSP1DATPPS_SSP1DATPPS1_POSITION                    0x1
#define _SSP1DATPPS_SSP1DATPPS1_SIZE                        0x1
#define _SSP1DATPPS_SSP1DATPPS1_LENGTH                      0x1
#define _SSP1DATPPS_SSP1DATPPS1_MASK                        0x2
#define _SSP1DATPPS_SSP1DATPPS2_POSN                        0x2
#define _SSP1DATPPS_SSP1DATPPS2_POSITION                    0x2
#define _SSP1DATPPS_SSP1DATPPS2_SIZE                        0x1
#define _SSP1DATPPS_SSP1DATPPS2_LENGTH                      0x1
#define _SSP1DATPPS_SSP1DATPPS2_MASK                        0x4
#define _SSP1DATPPS_SSP1DATPPS3_POSN                        0x3
#define _SSP1DATPPS_SSP1DATPPS3_POSITION                    0x3
#define _SSP1DATPPS_SSP1DATPPS3_SIZE                        0x1
#define _SSP1DATPPS_SSP1DATPPS3_LENGTH                      0x1
#define _SSP1DATPPS_SSP1DATPPS3_MASK                        0x8
#define _SSP1DATPPS_SSP1DATPPS4_POSN                        0x4
#define _SSP1DATPPS_SSP1DATPPS4_POSITION                    0x4
#define _SSP1DATPPS_SSP1DATPPS4_SIZE                        0x1
#define _SSP1DATPPS_SSP1DATPPS4_LENGTH                      0x1
#define _SSP1DATPPS_SSP1DATPPS4_MASK                        0x10
#define _SSP1DATPPS_SSP1DATPPS_POSN                         0x0
#define _SSP1DATPPS_SSP1DATPPS_POSITION                     0x0
#define _SSP1DATPPS_SSP1DATPPS_SIZE                         0x5
#define _SSP1DATPPS_SSP1DATPPS_LENGTH                       0x5
#define _SSP1DATPPS_SSP1DATPPS_MASK                         0x1F

// Register: SSP1SSPPS
#define SSP1SSPPS SSP1SSPPS
extern volatile unsigned char           SSP1SSPPS           __at(0xEC7);
#ifndef _LIB_BUILD
asm("SSP1SSPPS equ 0EC7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSP1SSPPS0             :1;
        unsigned SSP1SSPPS1             :1;
        unsigned SSP1SSPPS2             :1;
        unsigned SSP1SSPPS3             :1;
        unsigned SSP1SSPPS4             :1;
    };
    struct {
        unsigned SSP1SSPPS              :5;
    };
} SSP1SSPPSbits_t;
